In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [36]:
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [37]:
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [38]:
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.tail(10)

                 city             date   fare       ride_id
2365       Lake Jamie   4/19/2019 4:32  16.29  3.518680e+12
2366      North Holly  3/18/2019 10:38  40.34  3.787780e+12
2367      Michaelberg  1/27/2019 18:43  38.42  8.626220e+11
2368       Lake Jamie   4/29/2019 1:58  54.22  2.489260e+12
2369     Bradshawfurt  1/30/2019 10:55  51.39  1.328270e+12
2370      Michaelberg  4/29/2019 17:04  13.38  8.550370e+12
2371  Lake Latoyabury   1/30/2019 0:05  20.76  9.018730e+12
2372      North Jaime  2/10/2019 21:03  11.11  2.781340e+12
2373     West Heather   5/7/2019 19:22  44.94  4.256850e+12
2374       Newtonview  4/25/2019 10:20  55.84  9.990580e+12

In [39]:
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [40]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [41]:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [42]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [43]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [44]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [45]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [46]:
sum(city_data_df["type"]=="Suburban")

36

In [47]:
sum(city_data_df["type"]=="Rural")

18

In [52]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.908450e+12,46,Urban

In [51]:
pyber_data_df.isnull().sum()

city            0
date            0
fare            0
ride_id         0
driver_count    0
type            0
dtype: int64